## production: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 8 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                          NAME                           |
|----------|---------------------------------------------------------|
| recreate | `github_actions_secret.account_id`                      |
|          | `github_actions_secret.manifests_account_id`            |
| add      | `github_actions_secret.api_account_id`                  |
|          | `github_actions_secret.api_aws_access_key_id[0]`        |
|          | `github_actions_secret.api_aws_secret_access_key[0]`    |
|          | `github_actions_secret.api_op_service_account_token[0]` |
|          | `github_actions_secret.api_openai_api_key[0]`           |
|          | `github_actions_secret.api_slack_webhook[0]`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.account_id must be replaced
-/+ resource "github_actions_secret" "account_id" {
      ~ created_at      = "2024-05-30 18:44:34 +0000 UTC" -> (known after apply)
      ~ id              = "notification-terraform:PRODUCTION_ACCOUNT_ID" -> (known after apply)
      ~ secret_name     = "PRODUCTION_ACCOUNT_ID" -> "PRODUCTION_AWS_ACCOUNT_ID" # forces replacement
      ~ updated_at      = "2024-11-26 16:40:38 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.api_account_id will be created
  + resource "github_actions_secret" "api_account_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-api"
      + secret_name     = "PRODUCTION_AWS_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.api_aws_access_key_id[0] will be created
  + resource "github_actions_secret" "api_aws_access_key_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-api"
      + secret_name     = "PRODUCTION_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.api_aws_secret_access_key[0] will be created
  + resource "github_actions_secret" "api_aws_secret_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-api"
      + secret_name     = "PRODUCTION_AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.api_op_service_account_token[0] will be created
  + resource "github_actions_secret" "api_op_service_account_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-api"
      + secret_name     = "OP_SERVICE_ACCOUNT_TOKEN_PRODUCTION"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.api_openai_api_key[0] will be created
  + resource "github_actions_secret" "api_openai_api_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-api"
      + secret_name     = "OPENAI_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.api_slack_webhook[0] will be created
  + resource "github_actions_secret" "api_slack_webhook" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-api"
      + secret_name     = "SLACK_WEBHOOK"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_account_id must be replaced
-/+ resource "github_actions_secret" "manifests_account_id" {
      ~ created_at      = "2024-11-26 16:40:45 +0000 UTC" -> (known after apply)
      ~ id              = "notification-manifests:PRODUCTION_ACCOUNT_ID" -> (known after apply)
      ~ secret_name     = "PRODUCTION_ACCOUNT_ID" -> "PRODUCTION_AWS_ACCOUNT_ID" # forces replacement
      ~ updated_at      = "2024-11-26 16:40:45 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 8 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
